from game.main import MazeGame
from game.character import Character

map_data = [
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,1,1,0,0],
	[0,0,0,0,0,1,1,0,0,0],
	[0,0,0,0,1,1,0,0,0,0],
	[0,0,0,1,1,0,0,0,0,0],
	[0,0,1,1,0,0,0,0,0,0],
 	[0,0,1,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0]

]

configuration_data = [
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,2,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
 	[0,0,1,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0],
	[0,0,0,0,0,0,0,0,0,0]
]

if __name__ == '__main__':
    game = MazeGame(map_data, configuration_data)

    async def move_character(self:Character):
        # この下に命令を入力します
        await self.move_forward()

    game.main(move_character)